Revit 2027 API
BuiltInFailures.PipingFailures.FabFittingFailed Property
 The Fabrication Fitting was invalid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabFittingFailed { get; }
Public Shared ReadOnly Property FabFittingFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabFittingFailed {
	FailureDefinitionId^ get ();
}
static member FabFittingFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace